# UpdateExternallyTaggedGeometry Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
DirectShape..::..UpdateExternallyTaggedGeometry Method
DirectShape Class See Also
---
Updates the externally tagged geometry object in the DirectShape.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2022
# Syntax
C#
---
```text
public void UpdateExternallyTaggedGeometry(
	ExternallyTaggedGeometryObject externallyTaggedGeometry
)
```

Visual Basic
---
```text
Public Sub UpdateExternallyTaggedGeometry ( _
	externallyTaggedGeometry As ExternallyTaggedGeometryObject _
)
```

Visual C++
---
```text
public:
void UpdateExternallyTaggedGeometry(
	ExternallyTaggedGeometryObject^ externallyTaggedGeometry
)
```

# ### Parameters
externallyTaggedGeometry
    Type: Autodesk.Revit.DB..::..ExternallyTaggedGeometryObject The externally tagged geometry that should be updated in the DirectShape.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | A previous version of the externally tagged geometry is not present in this DirectShape. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DirectShape Class
Autodesk.Revit.DB Namespace